app/views/admin/items/new.html.erb

							<th>ジャンル</th>
							<td class="select_field"><%= f.collection_select :genre_id, Genre.all, :id, :name %></td>
---
SELECT "genres".* FROM "genres"