app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2022-05-05 16:05:51.623485"], ["updated_at", "2022-05-05 16:05:51.623485"]]
SELECT "genres".* FROM "genres"
---
    def create
        @genre = Genre.new(genre_params)
        if @genre.save
          redirect_to admin_genres_path
        else
          @genres = Genre.all

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "a"], ["updated_at", "2022-05-05 16:11:25.570786"], ["id", 6]]
---
    def update
        @genre = Genre.find(params[:id])
        if @genre.update(genre_params)