app/controllers/admin/items_controller.rb

    def create
        @item = Item.new(item_params)
        if @item.save
---
INSERT INTO "items" ("genre_id", "name", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 3], ["name", "55"], ["introduction", "55"], ["price", 55], ["is_active", 0], ["created_at", "2022-05-05 16:28:18.403373"], ["updated_at", "2022-05-05 16:28:18.403373"]]