app/controllers/public/customers_controller.rb

UPDATE "customers" SET "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["telephone_number", "2222"], ["updated_at", "2022-05-05 15:05:46.858072"], ["id", 3]]
---
    def update
        @customer = current_customer
        if @customer.update(customer_params)

UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2022-05-05 15:05:50.782709"], ["id", 3]]
---
    def withdraw
        @customer = current_customer
        @customer.update(is_deleted: true)